import s from "./cosacks.module.css";
import fisrtc from "../../images/firstc.webp";
import secondc from "../../images/secondc.webp";

const Cosacks = () => {
  return (
    <section className={s.wrapper}>
      <div className={s.container}>
        <div className={s.textWithImage}>
          <img src={fisrtc} alt="Description" className={s.leftImage} />
          <h3 className={s.name}>Сергій Шаменков</h3>
          <p>
            Образ-кліше козака в шароварах, створений наприкінці XIX – на
            початку XX ст., міцно ввійшов у свідомість. Цей образ був створений
            та поширений в творах мистецтва, в різних його варіантах та жанрах,
            від графіки до кінострічок, що нашарувалися впродовж двох останніх
            століть. Український козак уявляється одягнутим виключно в шаровари,
            а завдяки моді театральних колективів радянського періоду майже
            обов’язково ці шаровари є великими, червоними та блискучими.
            Прихильники такого кліше апелюють до описів, які вміщено в праці Д.
            Яворницького (1990, с. 158–160), при цьому забуваючи, в який час він
            працював, і про те, що ці описи – відображення того стану в
            гардеробі козацтва, що склався наприкінці XVIII – початку XIX ст. та
            був доступний досліднику. Назва шаровари походить від давньоперської
            мови, де означала буквально «одягу для ніг» (sărăbāra, sără-balla)
            (Lewis, Short 1879). Їхній крій та розмір ніяк неможливо простежити,
            тому що безліч зображень персів показують різні варіанти поясного
            одягу, в тому числі вузький. У словнику Лідела і Скота σαράβαρα
            описані як просторі штани скіфів («loose trousers worn by
            Scythians») (Liddell, H. G., Scott R. 1940). Головна риса, що
            відрізняє цей «одяг для ніг» від інших видів поясного одягу – це
            крій. Саме він визначає тип, а не схожі візуальні риси. Ознакою
            такого типу поясного одягу, як шаровари, є: великі частини – холоші
            (прямі або трапецієподібні), до яких додано зсередини великі
            видовжені чотири клини або велика прямокутна вставка. Вставки
            додають об’єм та ширину, від їхнього розміру залежить, наскільки
            матня буде звисати та фалдити. Завдяки таким вставкам вона може
            звисати нижче колін, а то й до землі – це дуже характерний та
            важливий момент. В залежності від крою та використаної тканини,
            зовнішній вигляд шаровар також був різним за довжиною та об’ємами.
            Шаровари – це досить умовний термін, і за документами не можна
            прослідкувати чітко, який конкретно їх варіант згадано, оскільки
            існували як неширокі, або короткі по коліно, так і дуже широкі і
            довгі види шаровар. Багато що залежало також від кількості та форми
            тканини, що використовувалася для вставки між ногами. Широкі зразки
            шаровар в османів та персів існували вже у XVІ ст., і деякі пізніші
            етнографічні зразки, показані в етнографічній праці М. Тільке (Tilke
            1922, pl. 7, 19,40, 41.46, 47, 58), дають можливість уявити варіації
            крою та вигляду цих шаровар. Іконографічні джерела дають нам
            можливість прослідкувати, що широкі зразки шаровар почали
            поширюватися в турків, а наприкінці XVII ст. з’явилися у поляків та
            козаків, де використовувалися паралельно з іншими видами поясного
            одягу (вузькими убранє, штанами та неширокими і короткими видами
            шаровар), а найширші зразки шаровар увійшли в моду лише наприкінці
            XVIІІ ст., у фінальній стадії існування українського козацтва. Саме
            тому, що цей одяг став останнім за часом, що використовувався
            козаками, він і закарбувався в народній пам’яті. Після цього широкі
            шаровари увійшли до етнографічного гардеробу деяких територій
            України.
          </p>
        </div>
        <div className={s.textWithImage}>
          <img src={secondc} alt="Description" className={s.rightImage} />
          <h3 className={s.name}>Сергій Шаменков</h3>
          <p>
            В сучасному уявленні іноді поняття «шаровари» сприймається через
            призму хибних уявлень, що пов’язують поясний одяг скіфів, давніх
            «русів» та козаків. На образ козаків у шароварах вплинули «Мамаї» –
            народні картини кінця XVIII–XIX ст. та гравюри до книги О.
            Рігельмана, опубліковані О. Бодянським в 1847 р. (Ригельман 1847),
            та Д. Бантиш-Каменським у 1830 р. (Бантыш-Каменский 1830). В них
            були вміщені малюнки козаків та інших представників населення
            України у досить аморфних та «партачних», на думку О. Сластьона
            (Сластьон 1931, с. 145), перемальовках XIX століття з рукопису О.
            Шафонського (Шаменков 2020). Популяризації викривленого погляду на
            одяг козаків та шаровари зокрема в загальній уяві, додали і
            ілюстрації С. Васильківського та М. Самокиша (Из украинской старины
            1900), які вважав «брехнею» сам Д. Яворницький. У листі до Б.
            Грінченка історик так висловився про альбом: «це задля вас нікчемний
            біль, і купувати вам його не слід. Я от цього “Альбома” три роки
            одмовлявсь, аж поки мені Маркс на голову не сів. Бачте малюнки що
            там поробив Васильковський, усі чисто брехня, через що я й не хотів
            прикладати моїх рук до того Альбому» (ред. Капустина 2005, с. 50;
            Абросимова 2010, с. 21). В подальшому шаровари міцно асоціюються
            саме з цими образами, а пізніше широкі, переважно червоні, зібрані
            поверх чобота на шнурі шаровари культивувалися в радянському та
            пострадянському мистецтві.
          </p>
        </div>
      </div>
    </section>
  );
};

export default Cosacks;
